app/controllers/answers_controller.rb

  def create
    form = params[:answer]
    user = User.find(form[:user_id])

    answer = Answer.new(form)
    if answer.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `answers` (`answer`, `updated_at`, `question_id`, `user_id`, `created_at`) VALUES('this is a question', '2009-04-30 17:42:34', 1, 1, '2009-04-30 17:42:34')