app/controllers/questions_controller.rb

  def show
    @user = User.find_by_id(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def survey
    @user = User.find_by_id(params[:userid])
    @step = params[:step]

    if @step.to_i <= 4

      #    get new question
      already_taken = @user.answers.size == 0 ? 0 : @user.answers.collect {|x| x.question_id}.join(",")
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `answers` WHERE (`answers`.question_id = 49)
SELECT * FROM `questions` WHERE (id NOT IN (0)) LIMIT 1
SELECT count(*) AS count_all FROM `answers` WHERE (`answers`.question_id = 53)
SELECT count(*) AS count_all FROM `questions`

  def create
    if Question.create(params[:question])
---
INSERT INTO `questions` (`updated_at`, `is_personal`, `question`, `created_at`) VALUES('2009-05-04 18:53:53', 0, 'This is a new question', '2009-05-04 18:53:53')

  def destroy
    begin
      question = Question.find(params[:id])
      if question.delete
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 54)
DELETE FROM `questions` WHERE (`id` IN (54))