app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = '') LIMIT 1
UPDATE `users` SET `diagnosis_month` = 3, `disease` = 'Testing', `relation_to_disease` = 'Diagnosed', `updated_at` = '2009-05-04 19:00:55', `diagnosis_year` = 1933 WHERE `id` = 5
UPDATE `answers` SET user_id = NULL WHERE (user_id = 5 AND id IN (28))
INSERT INTO `users` (`name`, `avatar_updated_at`, `diagnosis_month`, `diagnosis_year`, `updated_at`, `avatar_file_name`, `avatar_file_size`, `thoughts`, `relation_to_disease`, `avatar_content_type`, `survey_number`, `email`, `created_at`, `disease`) VALUES('Jimbo', NULL, 2, 1990, '2009-05-04 18:59:01', NULL, NULL, NULL, 'Caregiver', NULL, NULL, 'Jackass@donkey.net', '2009-05-04 18:59:01', 'Cancer')
---
  def create
    @user = User.find_by_email(params[:user][:email])

    if @user
      #      flash.notice = "Sorry but you can only take the survey once."
      @user.update_attributes(params[:user])
      @user.answers.delete_all
      redirect_to question_path(@user)  if @user.update_attributes(params[:user])
    else
      @user = User.new(params[:user])

      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2009-04-30 17:56:57', `thoughts` = 'That was neat' WHERE `id` = 1
---
  def update
    user = User.find(params[:id])

    unless (params[:user][:thoughts].blank?)
      if user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3
---
  def destroy
    user = User.find(params[:id])
    if user.destroy